cmsis-svd/cmsis-svd/data/Nuvoton/M051DE_v1.svd
       <register derivedFrom="P00_PDIO">
          <name>P01_PDIO</name>
          <displayName>P01_PDIO</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P02_PDIO</name>
          <displayName>P02_PDIO</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P03_PDIO</name>
          <displayName>P03_PDIO</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P04_PDIO</name>
          <displayName>P04_PDIO</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P05_PDIO</name>
          <displayName>P05_PDIO</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P06_PDIO</name>
          <displayName>P06_PDIO</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P07_PDIO</name>
          <displayName>P07_PDIO</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P10_PDIO</name>
          <displayName>P10_PDIO</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="P10_PDIO">
          <name>P11_PDIO</name>
          <displayName>P11_PDIO</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="P10_PDIO">
          <name>P12_PDIO</name>
          <displayName>P12_PDIO</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="P10_PDIO">
          <name>P13_PDIO</name>
          <displayName>P13_PDIO</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="P10_PDIO">
          <name>P14_PDIO</name>
          <displayName>P14_PDIO</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="P10_PDIO">
          <name>P15_PDIO</name>
          <displayName>P15_PDIO</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="P10_PDIO">
          <name>P16_PDIO</name>
          <displayName>P16_PDIO</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="P10_PDIO">
          <name>P17_PDIO</name>
          <displayName>P17_PDIO</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P20_PDIO</name>
          <displayName>P20_PDIO</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="P20_PDIO">
          <name>P21_PDIO</name>
          <displayName>P21_PDIO</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="P20_PDIO">
          <name>P22_PDIO</name>
          <displayName>P22_PDIO</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="P20_PDIO">
          <name>P23_PDIO</name>
          <displayName>P23_PDIO</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="P20_PDIO">
          <name>P24_PDIO</name>
          <displayName>P24_PDIO</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="P20_PDIO">
          <name>P25_PDIO</name>
          <displayName>P25_PDIO</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="P20_PDIO">
          <name>P26_PDIO</name>
          <displayName>P26_PDIO</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="P20_PDIO">
          <name>P27_PDIO</name>
          <displayName>P27_PDIO</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="P00_PDIO">
          <name>P30_PDIO</name>
          <displayName>P30_PDIO</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="P30_PDIO">
          <name>P31_PDIO</name>
          <displayName>P31_PDIO</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="P30_PDIO">
          <name>P32_PDIO</name>
          <displayName>P32_PDIO</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="P30_PDIO">
          <name>P33_PDIO</name>
          <displayName>P33_PDIO</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register derivedFrom="P30_PDIO">
          <name>P34_PDIO</name>
          <displayName>P34_PDIO</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="P30_PDIO">
          <name>P35_PDIO</name>
          <displayName>P35_PDIO</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register derivedFrom="P30_PDIO">
          <name>P36_PDIO</name>
          <displayName>P36_PDIO</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="P30_PDIO">
          <name>P37_PDIO</name>
          <displayName>P37_PDIO</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x27C</addressOffset>
       </register>
